import 'package:flutter/material.dart';
import 'package:easy_localization/easy_localization.dart';
import 'package:Hutaf/ui/widgets/app_bar/app_bar_with_leading.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({Key key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    final Size layoutSize = MediaQuery.of(context).size;

    return Scaffold(
      appBar: AppBarWithLeading(
        title: 'privacy.privacy_policy'.tr(),
        handler: () {
          Navigator.pop(context);
        },
      ),
      body: ListView(
        physics: const BouncingScrollPhysics(),
        padding: EdgeInsets.only(
          top: layoutSize.height * 0.03,
          right: layoutSize.width * 0.035,
          left: layoutSize.width * 0.035,
          bottom: layoutSize.height * 0.03,
        ),
        children: [
          title('المقدمة |\n', layoutSize, context),
          text(
            'نحن في هُتاف نهتم بجميع المنتسبين لدينا ونضع أولى اهتماماتنا إحترام خصوصية الفرد ونتعهد بحمايتها.  ستشرح هذه السياسة كيفية التصرف في معلوماتك الشخصية.\n يجب أن تعلم انه عند تسجيلك الأول في تطبيق هُتاف انك توافق على سياسة الخصوصية لدينا وتسمح لنا بالتصرّف وفق منهج سياسة التطبيق والشروط والأحكام التي يُعمل بها. \n\n',
            layoutSize,
            context,
          ),
          title('الأهلية |\n', layoutSize, context),
          text(
            'إن بياناتك الشخصية ستكون بأمان ولن يقوم تطبيق هُتاف بإبراز أي من المعلومات الشخصية للغير في ما عدا تلك البيانات التي تظهر في حسابك كصفحة تعريفية لك والتي ستكون من المحتمل في التحديثات المستقبلية متاحة كملف عرض للمستخدمين. \n\n',
            layoutSize,
            context,
          ),
          title('المعلومات التي يتم جمعها |\n', layoutSize, context),
          text(
            '•	قد يتم جمع وتخزين واستخدام المعلومات الشخصية التالية: معلومات حول جهاز النقّال المستخدم (التيلفون) الخاص بك بما في ذلك عنوان بروتوكول الإنترنت الخاص بك، والموقع الجغرافي، والإصدار، ونظام التشغيل.\n •	معلومات حول زياراتك لهذا التطبيق واستخدامه بما في ذلك مصدر الإحالة، ومدة الزيارة، وما تشاهده على الصفحة، ومسارات التصفح في التطبيق.\n •	المعلومات التي تدخلها عند التسجيل في تطبيق هُتاف، مثل عنوان بريدك الإلكتروني، رقم الهاتف، الأسم، الجنس، تاريخ الميلاد، والاهتمامات.\n •	المعلومات التي تدخلها أثناء استخدام الخدمات على تطبيق هُتاف.\n •	المعلومات الواردة في أي مراسلات ترسلها إلينا عبر البريد الإلكتروني كالإستفسار أو المساعدة أو حتى التواصل مع الفنيين في حين احتجت للمساعدة.\n •	المعلومات المتعلقة بأي شيء تشتريه، أو الخدمات التي تستخدمها، أو المعاملات التي تجريها داخل تطبيق هُتاف، والتي تشمل اسمك وعنوانك ورقم هاتفك وعنوان بريدك الإلكتروني وتفاصيل بطاقة الائتمان.\n\n ',
            layoutSize,
            context,
          ),
          title('استخدام معلوماتك الشخصية |\n', layoutSize, context),
          text(
            'تستخدم المعلومات الشخصية المقدمة إلينا عبر تطبيق هُتاف في الأغراض الموضحة في هذه السياسة أو على الصفحات ذات الصلة من التطبيق. قد نستخدم معلوماتك الشخصية في الأغراض التالية:\n •	تخصيص تطبيقنا ليكون أكثر ملاءمة بالنسبة لك.\n •	تمكينك من استخدام الخدمات المتاحة على تطبيقنا.\n •	تمكينك من إستخدام الكتب أو البرامج او القصص او الدورات  التي تشتريها من التطبيق.\n •	إرسال البيانات والفواتير وإشعارات الدفع لك، وتحصيل المدفوعات منك.\n •	إرسال رسائل تجارية أو اعلانية تسويقية إليك التي ستكون كإشعارات على التطبيق أو على بريدك الإلكتروني.\n •	إرسال المراسلات التسويقية المتعلقة بأعمالنا كنشر كتب جديدة أو دورات تدريبية جديدة أو الإعلان عن عرروض والتي نعتقد أنها قد تهمك، عن طريق البريد أوالإشعارات داخل التطبيق.\n •	تزويد الأطراف الثالثة (المعلنين) بمعلومات إحصائية عن مستخدمينا أو عن التفاعل داخل التطبيق غير أن هذه الأطراف الثالثة لن تتمكن من تحديد المستخدمين لتلك المعلومات بحد ذاتهم.\n •	التعامل مع الاستفسارات والشكاوى التي تقدمها أنت أو تقدم لنا بشأنك على تطبيقنا.\n •	حماية التطبيق من الاحتيال والحفاظ على أمنه.\n •	التحقق من الامتثال للشروط والأحكام التي تحكم استخدام موقعنا الإلكتروني (بما في ذلك مراقبة الرسائل الخاصة المرسلة عبر خدمة الرسائل الخاصة بتطبيق هُتاف)\n •	استخدامات أخرى لها نفس التوجه والأهداف.\n •	يمكنك تعديل بياناتك التي قمت بتسجيلها لأول مره لدينا باستخدام عناصر التحكم في الإعدادات الموجودة على التطبيق كما إن هذه البيانات أيضًا ستكون محفوظة لدينا وسيتم التعامل معها كما لو إنها بياناتك الحقيقية.\n •	لن نزود أي طرف ثالث، دون موافقتك الصريحة، بمعلوماتك الشخصية لأغراض التسويق المباشر لأي طرف آخر.\n \n',
            layoutSize,
            context,
          ),
          title('الكشف عن المعلومات الشخصية |\n', layoutSize, context),
          text(
            'يمكن أن نقوم بالكشف عن معلوماتك الشخصية لأي من موظفينا أو مسؤولينا أو شركات التأمين أو المستشارين المحترفين أو الوكلاء أو الموردين أو المقاولين من الباطن التابعين لنا، بالقدر الضروري بشكل معقول للأغراض المنصوص عليها في هذه السياسة. قد نقوم بالإفصاح عن معلوماتك الشخصية لأي عضو في مجموعة شركاتنا (وهذا يعني الشركات التابعة لنا، والشركة القابضة الأصلية وجميع فروعها) بالقدر الضروري بشكل معقول للأغراض المنصوص عليها في هذه السياسة. \n\n قد نكشف عن معلوماتك الشخصية:\n •	القدر الذي يطلب منا القيام به بموجب القانون.\n •	فيما يتعلق بأي إجراءات قانونية جارية أو محتملة.\n •	من أجل إنشاء أو ممارسة أوالدفاع عن حقوقنا القانونية (بما في ذلك توفير معلومات للآخرين لأغراض منع الاحتيال والحد من مخاطر الائتمان).\n •	أي شخص نعتقد على نحو معقول أنه قد يتقدم بطلب إلى محكمة أو سلطة مختصة أخرى بطلب الإفصاح عن تلك المعلومات الشخصية، وفقًا لتقديرنا المعقول، ويكون من المحتمل بشكل معقول أن تأمر هذه المحكمة أو السلطة بالكشف عن تلك المعلومات الشخصية. باستثناء ما هو منصوص عليه في هذه السياسة، فإننا لن نقدم معلوماتك الشخصية إلى أطراف ثالثة.\n \n',
            layoutSize,
            context,
          ),
          title('النقل الدولي للبيانات |\n', layoutSize, context),
          text(
            'قد يتم تخزين المعلومات التي نجمعها أو معالجتها أو نقلها بين أي من البلدان التي نعمل فيها لتمكيننا من استخدام المعلومات وفقًا لهذه السياسة.\n قد يتم نقل المعلومات التي نجمعها إلى البلدان التالية والتي لا تخضع لقوانين حماية البيانات المكافئة لتلك المعمول بها في المنطقة الاقتصادية الأوروبية: وهذه الدول هي الولايات المتحدة الأمريكية، روسيا، اليابان، الصين، والهند.\nلا نستطيع منع استخدام الآخرين أو إساءة استخدامهم للمعلومات الشخصية التي تنشرها على تطبيقنا الرقمي أو التي ترسلها للنشر على موقعنا الإلكتروني والمتاحة عبر الإنترنت في جميع أنحاء العالم.\n "أنت توافق صراحةً على عمليات نقل المعلومات الشخصية الموضحة في هذا القسم " \n\n',
            layoutSize,
            context,
          ),
          title('الاحتفاظ بالمعلومات الشخصية |\n', layoutSize, context),
          text(
            ' يحدد هذا القسم السياسات والإجراءات التي نتبعها للاحتفاظ بالبيانات، والتي صممت للمساعدة في ضمان امتثالنا لالتزاماتنا القانونية المتعلقة بالاحتفاظ بالمعلومات الشخصية وحذفها.\n لا يجوز الاحتفاظ بالمعلومات الشخصية التي نقوم بمعالجتها لأي غرض أو أغراض لفترة أطول مما هو ضروري لهذا الغرض أو لتلك الأغراض.\n\n بصرف النظر عن الأحكام الأخرى الواردة في هذا القسم، فإننا نحتفظ بالوثائق (بما في ذلك المستندات الإلكترونية) التي تحتوي على بيانات شخصية: \n •	بالقدر المطلوب بموجب القانون.\n •	إذا كنا نعتقد أن هذه المستندات قد تكون ذات صلة بأي إجراءات قانونية جارية أو محتملة.\n •	من أجل بدء أو ممارسة أو الدفاع عن حقوقنا القانونية (بما في ذلك توفير المعلومات للآخرين لأغراض منع الاحتيال والحد من مخاطر الائتمان).\n \n',
            layoutSize,
            context,
          ),
          title('أمن معلوماتك الشخصية |\n', layoutSize, context),
          text(
            '•	أمن معلوماتك الشخصية  نتعهد باتخاذ الاحتياطات التقنية والتنظيمية المعقولة لمنع فقدان معلوماتك الشخصية أو إساءة استخدامها أو تغييرها.\n •	نتعهد بتخزين جميع المعلومات الشخصية التي تقدمها على خوادمنا الآمنة (المحمية بكلمة مرور وجدار الحماية).\n •	جميع المعاملات المالية الإلكترونية التي يتم القيام بها من خلال تطبيقنا الرقمي محمية بتقنية التشفير.\n •	تقرّ بموافقتك على هذه السياسة بمعرفتك بأن نقل المعلومات عبر الإنترنت غير آمن بطبيعته، ولا يمكننا ضمان أمن البيانات المرسلة عبر الإنترنت.\n •	أنت مسؤول عن الحفاظ على سرية كلمة المرور التي تستخدمها للوصول إلى تطبيقنا. لن نطلب منك كلمة المرور الخاصة بك (إلا عند تسجيل الدخول إلى التطبيق). \n\n',
            layoutSize,
            context,
          ),
          title('التعديلات |\n', layoutSize, context),
          text(
            'قد نقوم بتحديث هذه السياسة من وقت لآخر عن طريق نشر نسخة جديدة لتطبيقنا. يجب عليك مراجعة هذه الصفحة من حين لآخر للتأكد من فهمك لأي تغييرات تطرأ على هذه السياسة، وقد نخطرك بالتغييرات التي تطرأ على هذه السياسة عن طريق البريد الإلكتروني أو من خلال نظام المراسلة الخاص على تطبيقنا. \n\n',
            layoutSize,
            context,
          ),
          title('مواقع الطرف الثالث (المعلنين) |\n', layoutSize, context),
          text(
            'يشتمل موقعنا على روابط تشعبية وتفاصيل عن مواقع خاصة بأطراف ثالثة وهم المعلنين لدينا، علمًا بأنه ليس لدينا أي سيطرة على سياسات الخصوصية وممارسات الأطراف الثالثة (المعلنين) كما أننا لسنا مسؤولين عنها. فلا يحق لك المطالبة بإزالتها او المساس بها بأي شكل من الأشكال وإذا كان لديك أي استفسار أو شكوى تقدمها تخص الأطراف الثالثة يمكنك إرسال بريد إلكتروني موضحاً الأسباب.\n\n',
            layoutSize,
            context,
          ),
          title('تحديث المعلومات |\n', layoutSize, context),
          text(
            'يرجى إعلامنا إذا كانت المعلومات الشخصية التي نحتفظ بها عنك تحتاج إلى تصحيح أو تحديث. \n\n ــــــــ \n',
            layoutSize,
            context,
          ),
          text(
            'للاستفسار أو الإبلاغ عن أي مشكلة نرجو التواصل عبر البريد الإلكتروني الموضح أدناه، \n كما نرجو لكم الاستمتاع والاستفادة من استخدام هُتاف... \n\nالبريد الإلكتروني: ',
            layoutSize,
            context,
          ),
          title('hutaf.app@gmail.com\n\n', layoutSize, context),
        ],
      ),
    );
  }

  Widget text(String text, Size layoutSize, BuildContext context) {
    return Text(
      text,
      textScaleFactor: 1,
      style: Theme.of(context).primaryTextTheme.caption.copyWith(
            fontSize: layoutSize.width * 0.04,
          ),
    );
  }

  Widget title(String text, Size layoutSize, BuildContext context) {
    return Text(
      text,
      textScaleFactor: 1,
      style: Theme.of(context).textTheme.bodyText2.copyWith(
            fontSize: layoutSize.width * 0.04,
          ),
    );
  }
}
