import 'package:flutter/material.dart';
import 'package:easy_localization/easy_localization.dart';
import 'package:Hutaf/ui/widgets/app_bar/app_bar_with_leading.dart';

class Rules extends StatelessWidget {
  const Rules({Key key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    final Size layoutSize = MediaQuery.of(context).size;

    return Scaffold(
      appBar: AppBarWithLeading(
        title: 'rules.rules_title'.tr(),
        handler: () {
          Navigator.pop(context);
        },
      ),
      body: ListView(
        physics: const BouncingScrollPhysics(),
        padding: EdgeInsets.only(
          top: layoutSize.height * 0.03,
          right: layoutSize.width * 0.035,
          left: layoutSize.width * 0.035,
          bottom: layoutSize.height * 0.03,
        ),
        children: [
          text(
            'عزيزي المستخدم أهلا بك في تطبيق هُتاف (ويشار إليه بشركة هُتاف الرقمية) والتي تندرج تحت مجموعة شركات (العملة للاستثمار) الرجاء قراءة الشروط والأحكام بعناية لاستخدام تطبيق هُتاف. لا يجوز الاستمرار في استخدام تطبيق هُتاف أو الانتفاع بخدماته في حال عدم موافقتك على الشروط والأحكام، ويعتبر استمرارك باستخدام التطبيق بمثابة موافقة على شروط استخدام التطبيق. \n ــــــ \n',
            layoutSize,
            context,
          ),
          title('المقدمة |\n', layoutSize, context),
          text(
            'تطبيق هُتاف بمثابة مكتبة ثقافية تضم العديد من الكُتب الأدبية المختلفة والدورات التعليمية التدريبية والمهنية والبرامج والقصص التي خصناها (لذوي الإعاقة السمعية) والتي ستكون مُتاحة لك ولجميع مستخدمي التطبيق، وعندما تبدأ باستخدام تطبيق هُتاف فأنت توافق على الالتزام بهذه الشروط والأحكام وفي حال عدم موافقتك على الشروط والأحكام يتعين عليك عدم استخدام التطبيق، وعليه فإننا نحتفظ بحقنا بتغيير الشروط والأحكام من وقت لآخر وبالتالي يتعين عليك الاطلاع على هذه الشروط والأحكام بشكلٍ دوري، ولا يتوجب علينا الاتصال بك أو إعلامك بأي تغييرات تم إجراؤها على الشروط والأحكام، ويعتبر استمرار استخدامك لتطبيق هُتاف بمثابة موافقة على الشروط والأحكام المطبّقة في وقت استخدامك للموقع والتطبيق كجزء من التزامنا بجعل تطبيق هُتاف مكانا ترغب في زيارته باستمرار فإننا نرحب بكافة تعليقاتك على أي من السياسات أو القواعد التي ندرجها أدناه. \n ___ \n',
            layoutSize,
            context,
          ),
          title('الأهلية |\n', layoutSize, context),
          text(
            'نحن في هُتاف نقوم بصناعة محتوى ثقافي تعليمي بشتّى ضروبه بالاتفاق مع العديد من الكُتَّاب والمدربين المهنيين والمختصين في لغة الإشارة وبالتعاون مع طاقم إنتاج احترافي يشمل ذلك خطط إنتاجية شاملة وواسعة النطاق تمتد منذ بداية الفكرة مروراً بمراحلها الإنتاجية مع تحمّل تكاليفها المادية حتى نصل لمرحلة رفعها ونشرها داخل تطبيق هتاف وبذلك يُعتبر جميع حقوق المنتجات داخل التطبيق مملوكة لدى (شركة هتاف الرقمية) ولا يجوز المساس بها بأي شكل من الأشكال. \n ___ \n',
            layoutSize,
            context,
          ),
          title('النص التمهيدي: \n', layoutSize, context),
          text(
            'يضم تطبيق هُتاف أعداد لامحدودة من الكتب الصوتية والقصص والبرامج التعليمية والتثقيفية (بالنسبة لذوي الإعاقة السمعية)، نحن فريق هُتاف نقوم بإنتاجها أو بالتعاون مع شركاء في الإنتاج وسيتعّين علينا ذكر دور النشر ان وجد واسم المؤلف والقارئ وفي بعض الأحيان ستكون هناك مؤسسات راعية لهذا الإنتاج وهي بمثابة داعم لمشروع هُتاف. جميع ما ينتج في هُتاف هو متاح لجميع المستخدمين حسب التنوع في عرضها ان كانت كتب أو مخصصات ذوي الإعاقة السمعية مجانية أو محدودة للبعض كالتي تخضع للبيع بطرق الشراء المفرد أو الاشتراك في أحد باقات هُتاف فهي فقط مخصوصة للمشترين ولكنه دون حق التملك الانحيازي. حيث أنه لا يجوز بأي طريقة من الطرق لأي مستخدم نسخها أو تسجيلها أو تصويرها بطرق غير مشروعة لأن ذلك يندرج تحت مسّمى سرقة المحتوى ويحق لشركة هُتاف الرقمية مقاضاة الفاعل. نحن نهدف في هُتاف للاستمرارية وإبقاء المحتوى حصري في تطبيق هُتاف دون غيره. \n ___ \n',
            layoutSize,
            context,
          ),
          title('التزامات المستخدم |\n', layoutSize, context),
          text(
            'يُقر المستخدم و يتعهد بأن يتصفح التطبيق أو يستخدم الخدمات الموجودة به حسب ما هو منصوص عليه في الشروط والأحكام و التشريعات النافذة : \n 1- لايجوز لمستخدمي تطبيق هُتاف محاولة نسخ او تسجيل صوت أي من الكتب المرفوعة في مكتبة التطبيق كما لا يجوز محاولة تصوير أو التقاط شاشة أي من الدورات أو البرامج المخصصة لذوي الإعاقة السمعية، في حين قيامك بـ مشاهدتها لأي هدف من الأهداف. ويجوز للمستخدم فقط الاستماع أو المشاهدة فقط داخل التطبيق. \n 2- لا يجوز نسب أي من الكتب أو الدورات لأشخاص أخرين دون أصحابها المشار إليهم بداخل التطبيق. \n 3- لا يجوز نسب ملكية الإنتاج أو حقوق التملك لأي من الكتب أو البرامج الموجودة بداخل تطبيق هُتاف لأي تطبيق آخر له نفس فكرة عمل مشروع هُتاف. \n 4- لايجوز للمستخدمين أعطاء حساباتهم التي سبق وقاموا بالتسجيل بها في تطبيق هُتاف لآخرين حيث أن يفترض عملية الشراء داخل التطبيق هي مخصوصة للمستخدم الواحد أو على أقل تقدير أسرته فقط، وهذا أيضًا لضمان حماية خصوصياتك ومعلوماتك الشخصية والبنكية التي قمت بإدخالها عند تسجيلك في التطبيق. \n 5- لا يجوز لأي مستخدم مشاركة الكتاب أو الدورات أو البرامج المخصصة لذوي الإعاقة السمعية التي يشتريها مع الغير بأي طريقة كانت فهذا الكتاب والدورة قد تم إنتاجهم بتكاليف مادية وجهد جهيد فينبغي عدم مشاركته مع الآخرين لأن حقه الشراء فقط. \n 6- عند الشراء أو الاشتراك سيُخصم من رصيدك فوراً تكلفة الشراء ولا يحق المطالبة باسترجاعها، كما إننا سنضع لك نموذج صوتي لكل كتاب وكذلك نموذج مرئي لكل دورة لمعرفة نوعية المحتوى قبل الشراء. \n ___ \n',
            layoutSize,
            context,
          ),
          title('حقوق الملكية الفكرية والعلامة التجارية |\n', layoutSize,
              context),
          text(
            'هُتاف هي المالك الوحيد لكافة حقوق النشر وحقوق الملكية الفكرية كـ(العلامة التجارية او المحتوى الأدبي والتعليمي ... والخ) الخاصة بالتطبيق، كل جزء من التطبيق محمي بحقوق النشر لذلك لايحق نسخ أي جزء من التطبيق أو توزيعه لأي غرض من الأغراض دون الحصول على موافقة خطية من شركة هُتاف الرقمية. \n ___ \n ',
            layoutSize,
            context,
          ),
          title('القانون المطبّق والإختصاص القضائي |\n', layoutSize, context),
          text(
            'تخضع هذه الشروط والأحكام للقوانين المعمول بها في سلطنة عُمان ويخضع أي نزاع ينشأ له علاقة بـ أو سبب هذه الشروط والأحكام بشكل حصري للاختصاص القضائي للمحاكم العمانية، \n كما أنه يحق لشركة هُتاف اتخاذ أي إجراء تجاه حساب المستخدم المخالف داخل التطبيق كالتحذير والتنبيه وإن لزم الأمر ستقوم بحظر حسابه وايقافه من استخدام التطبيق ويحق لهتاف إعطاء بيانات المستخدم للجهات القانونية الأمنية والقضائية إن لزم الأمر ولاحق للمستخدم المسألة بذلك. \n ___ \n',
            layoutSize,
            context,
          ),
          title('المسؤولية |\n', layoutSize, context),
          text(
            'هُتاف غير مسؤول عن أي سوء استخدام للتطبيق مانقوم به من إجراءات هي كلها تصب في مصلحة تحسين الخدمة التي نقدمها لكم. \n - ننصح عدم السماح للأطفال دون السن المذكور باستخدام التطبيق دون رقابة أحد أولياء الأمور لمعرفة توجهات أبناؤكم ومراقبتهم. \n __ \n',
            layoutSize,
            context,
          ),
          text(
            'للاستفسار أو الإبلاغ عن أي مشكلة نرجو التواصل عبر البريد الإلكتروني الموضح أدناه، \n كما نرجو لكم الاستمتاع والاستفادة من استخدام هُتاف... \n\nالبريد الإلكتروني: ',
            layoutSize,
            context,
          ),
          title('hutaf.app@gmail.com\n\n', layoutSize, context),
        ],
      ),
    );
  }

  Widget text(String text, Size layoutSize, BuildContext context) {
    return Text(
      text,
      textScaleFactor: 1,
      style: Theme.of(context).primaryTextTheme.caption.copyWith(
            fontSize: layoutSize.width * 0.04,
          ),
    );
  }

  Widget title(String text, Size layoutSize, BuildContext context) {
    return Text(
      text,
      textScaleFactor: 1,
      style: Theme.of(context).textTheme.bodyText2.copyWith(
            fontSize: layoutSize.width * 0.04,
          ),
    );
  }
}
